---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketchRegen
source: html/3c73e808-b8fb-ed1f-c490-8b08f6df50dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketchRegen Property

Crop area sketch can either be empty or include one closed, not self-intersecting loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidCropAreaSketchRegen { get; }
```